/*******************************************************************************************
程序名： DS18B20温度传感器设计温控系统
编写人： 花花雪
编写时间： 2016 年 7月23日
硬件支持：AT89S52 DS18B20 数码管 LED灯 蜂鸣器
接口说明：
修改日志：
NO.1
/*******************************************************************************************
//说明 ：
			
*******************************************************************************************/
# include <reg52.h>
# include <stdio.h>
# define uchar unsigned char
# define uint unsigned int
sbit ds= P2^2;		//
sbit dula= P2^6;		//
sbit wela= P2^7;		//
sbit beep= P3^6;		//
uint temp;	//
uint t;
uint templa;
float f_temp;
uint warn_l1=270;
uint warn_l2=250;
uint warn_h1=300;
uint warn_h2=320;
sbit led0=P1^0;
sbit led1=P1^1;
sbit led2=P1^3;
sbit led3=P1^4;
unsigned char code table[]={0x40,0x79,0x24,0x30,0x19,0x12,0x02,
							0x78,0x00,0x10,//
							0xc0,0xf9,0xa4,0xb0, 0x99,0x92,0x82,0xf8,0x80,0x90};//
/*******************************************************************************************
函数名：delay_ms
调  用：delay_ms(x)
参  数：uint x
返回值：无
结  果：
注  释：延时程序
*******************************************************************************************/

void delay(uint x)
	{
	  	uint i,j;
		for(i=x;i>0;i--)
			for(j=110;j>0;j--);
	}
/*******************************************************************************************
函数名：DS18B20复位，初始化函数
调  用：dsreset()
参  数：
返回值：无
结  果：
注  释：具体过程，参考DS18B20的工作时序图
*******************************************************************************************/
void dsreset (void)
{
	uint i;
	ds=0;	   		// 数据线拉低到低电平0
	i=103;
	while(i>0)		// 延时，480~960us，想延长多长时间，参考指令周期，可以计算求出。
		i--;
	ds=1;			//	数据线拉低到高电平1
	i=4;
		while(i>0) 	// 延时等待，15~60us
		i--;
}
/*******************************************************************************************
函数名：读位数据函数
调  用：tempreadbit()
参  数：
返回值：dat
结  果：
注  释：具体过程，参考DS18B20的读数据工作时序图
*******************************************************************************************/
bit tempreadbit(void)
{
 	uint i;
	bit dat;
	ds=0;	   	//	数据线拉低到0
	i++;		//	延时
	ds=1;		//	数据线拉高到1
	i++;i++;   	//	延时
	dat=ds;		//读数据线得到一个状态位
	i=8;
	while(i>0)	//处理延时
		i--;
	return (dat);
}
 /*******************************************************************************************
函数名：读字节数据函数
调  用：tempread()
参  数：
返回值：dat
结  果：
注  释：具体过程，参考DS18B20的读数据工作时序图
*******************************************************************************************/
uchar tempread()
{
	uchar i,j,dat;
	dat=0;
	for(i=1;i<=8;i++)
	{
		j=tempreadbit();
		dat=(j<<7)|(dat>>1);
	}	
	return (dat);
}
 /*******************************************************************************************
函数名：写字节数据函数
调  用：tempwritebyte()
参  数：
返回值：
结  果：
注  释：具体过程，参考DS18B20的写数据工作时序图
*******************************************************************************************/
void tempwritebyte(uchar dat)
{
	uint i;
	uchar j;
	bit testb;
	for(j=1;j<=8;j++)
	{
		testb=dat&0x01;
		dat=dat>>1;
		if(testb)//	写1
		{
		 	ds=0;
			i++;i++;
			ds=1;
			i=8;
			while(i>0)i--;
		}
		else
		{
			ds=0;//写0
			i=8;
			while(i>0)i--;
			ds=1;
			i++;i++;
		}
	}
}
 /*******************************************************************************************
函数名：获取温度并转换函数
调  用：tempchange()
参  数：
返回值：
结  果：
注  释：具体指令，参考DS18B20手册
*******************************************************************************************/
void tempchange(void)
{
	dsreset();
	delay(1);
	tempwritebyte(0xcc);   	//
	tempwritebyte(0x44);	//
}
 /*******************************************************************************************
函数名：读寄存器中存储的温度数据
调  用：get_temp()
参  数：
返回值：temp
结  果：
注  释：具体指令，参考DS18B20手册
*******************************************************************************************/
uint get_temp()
{
	uchar a,b;
	dsreset();
	delay(1);
	tempwritebyte(0xcc);
	tempwritebyte(0xbe);
	a=tempread(); 		// 读低八位
	b=tempread();		// 读高八位
	temp=b;
	temp<<=8;			//两个字节组成一个字
	temp=templa;
	f_temp=temp*0.0625;	//温度在寄存器中为12位，分辨率0.0625；
	temp=f_temp*10+0.5;//乘以10表示小数点后面只取1位，加0.5是四舍五入；
	f_temp=f_temp+0.05;
	return temp;
}
 /*******************************************************************************************
函数名：数据显示程序
调  用：display()
参  数： num:第几个数码管 dat：要显示的数字
返回值：
结  果：
注  释：数码管显示温度
*******************************************************************************************/
void display(uchar num,uchar dat)
{
	uchar i;
	dula=0;
	P0=table[dat];	//编码赋给P0
	dula=1;
	dula=0;
	wela=0;
	i=0xFF;
	i=i&(((0x01)<<(num)));
	P3=i;
	//wela=1;
	//wela=0;
	
	delay(1);
}
 /*******************************************************************************************
函数名：显示温度数值函数
调  用：dis_temp()
参  数：t:温度值
返回值：
结  果：
注  释：显示温度数值函数，t传递的是整形温度值
*******************************************************************************************/
void dis_temp(uint t)
{
 	uchar i;
	i=t/100;	  	//	温度的十位
	display(0,i);	//
	i=t%100/10;		// 个位
	display(1,i+10);	
	i=t%100%10;		//小数
	display(2,i);
}
 /*******************************************************************************************
函数名：蜂鸣器警报，灯闪烁
调  用：warn()
参  数：s:音调；led：灯
返回值：
结  果：
注  释：
*******************************************************************************************/
void warn(uint s,uchar led)
{
 	uchar i;i=s;
	beep=0;		 	//蜂鸣器响
	P1=~(led); 		//灯亮
	while(i--)
	{
	 	dis_temp(get_temp());//用温度显示函数起到延时作用
	}
	beep=1;
	P1=0xff;
	i=s;
	while(i--)
	{
	 	dis_temp(get_temp());//用温度显示函数起到延时作用
	}

}

 /*******************************************************************************************
函数名：温度处理函数
调  用：deal()
参  数：t:温度值
返回值：
结  果：
注  释：显示温度数值函数，t传递的是整形温度值
*******************************************************************************************/
void deal(uint t)
{
 	uchar i;
	if((t>warn_l2)&&(t<=warn_l1))
	{
		warn(40,0x01);
	}
	else if(t<=warn_l2)
	{
	  	warn(10,0x03);
	}
	else if((t>warn_h2)&&(t<=warn_h1))
	{
	  	warn(40,0x04);
	}
	else if(t>=warn_h2)
	{
	  	warn(10,0x0c);
	}
	else
	{
		i=40;
		while(i--)
		{
		 	dis_temp(get_temp());
		}
	}
}
 /*******************************************************************************************
函数名：主程序
调  用：
参  数：t
返回值：
结  果：
注  释：
*******************************************************************************************/
void main()
{
 	uchar i;
//	dula=0;
//	wela=0;
	while(1)
	{
		tempchange();
		for(i=10;i>0;i--)
		{
			t=get_temp();
			dis_temp(t);	
		}
		deal(temp);
	}
}